docs/shillscore.org
#+TITLE: shillscore calculation
#+AUTHOR: Dang Quang Vu
#+EMAIL: jayden.dangvu@gmail.com

* Shill Score Calculation
** Parameters
- X performance
- Views: average views in last … posts
- Likes: average likes in last … posts
- Retweets: average retweets in last … posts
- Reply: average reply count in last … posts
- Shill performance
  - Average % to ATH after first post in 30D: ((ATH - price-at-post) * 100) / Price-at-post
  - Average % change at current price: ((Current-price - price-at-post) * 100) / Price-at-post

** Calculation
*** Min – Max Scaling
- Views:
  - \( v = \frac{\text{average views} - \text{Min}(v)}{\text{Max}(v) - \text{Min}(v)} \)
  - Min(v) = 100
  - Max(v) = 100,000

- Likes:
  - \( l = \frac{\text{average likes} - \text{Min}(l)}{\text{Max}(l) - \text{Min}(l)} \)
  - Min(l) = 10
  - Max(l) = 10,000

- Retweets:
  - \( r = \frac{\text{average retweets} - \text{Min}(r)}{\text{Max}(r) - \text{Min}(r)} \)
  - Min(r) = 10
  - Max(r) = 2,000

- Replies:
  - \( rp = \frac{\text{average replies} - \text{Min}(rp)}{\text{Max}(rp) - \text{Min}(rp)} \)
  - Min(rp) = 5
  - Max(rp) = 1,000

- % to ATH:
  - \( ath = \frac{\text{average ATH} - \text{Min}(ath)}{\text{Max}(ath) - \text{Min}(ath)} \)
  - Min(ath) = -90
  - Max(ath) = 10,000 (100x)

- % change at current price:
  - \( c = \frac{\text{average \% change} - \text{Min}(c)}{\text{Max}(c) - \text{Min}(c)} \)
  - Min(c) = -90
  - Max(c) = 10,000 (100x)

*** Weighted Raw Score
- \( \text{raw} = v + 2l + 4r + rp + \frac{11 + 3ath + c}{4} \)

*** Shill Score (1 – 9999)
- \( \text{shill} = 9998 \cdot \text{raw} + 1 \)

** Test Case
| Parameter   | Value  | Min   | Max   | Scaled Value   |
|-------------|--------|-------|-------|----------------|
| views       | 10000  | 100   | 100000| 0.099099099    |
| likes       | 5000   | 10    | 10000 | 0.499499499    |
| retweets    | 1000   | 5     | 2000  | 0.498746867    |
| replies     | 100    | 5     | 1000  | 0.095477387    |
| % to ATH    | 1000   | -90   | 10000 | 0.10802775     |
| % current   | 100    | -90   | 10000 | 0.018830525    |

** Calculations

| Parameter            | Formula                             | Result         |
|----------------------|-------------------------------------|----------------|
| raw                  | v + 2l + 4r + rp + (11 + 3ath + c)/4| 2.00818545     |
| shill                | 9998 * raw + 1                      | 20087.83817    |
